# 第4章 pandas入门

## 4.2 pandas数据结构之DataFrame

In [1]:
import numpy as np
from pandas import DataFrame

In [2]:
a=np.random.randint(0,100,(10,10))

In [4]:
data=DataFrame(a)

In [5]:
data

    0   1   2   3   4   5   6   7   8   9
0  77  49  47  92  35   5  84  54  54  23
1  74  91  29  72  78  35  25  68  71  54
2  97  95  19  47  88  39  76  27  30  94
3  53  25   7  70  93  54  32  64  61  90
4   4  19  57  51  28  38   6   0  71  22
5  38  85  48  52  95  29  12   4  68   9
6   2   1  61  41  53  33  53  68   0  81
7  62  97  45  14  52  48  99  62  80  57
8  11  68  84  37   2  49  67  28   3  77
9   1  88  39  65  37  63  34  42  88  74

In [6]:
data.shape

(10, 10)

In [7]:
len(data)

10

In [8]:
data.columns

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [9]:
data.dtypes

0    int32
1    int32
2    int32
3    int32
4    int32
5    int32
6    int32
7    int32
8    int32
9    int32
dtype: object

In [10]:
data.index

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [11]:
data.values

array([[77, 49, 47, 92, 35,  5, 84, 54, 54, 23],
       [74, 91, 29, 72, 78, 35, 25, 68, 71, 54],
       [97, 95, 19, 47, 88, 39, 76, 27, 30, 94],
       [53, 25,  7, 70, 93, 54, 32, 64, 61, 90],
       [ 4, 19, 57, 51, 28, 38,  6,  0, 71, 22],
       [38, 85, 48, 52, 95, 29, 12,  4, 68,  9],
       [ 2,  1, 61, 41, 53, 33, 53, 68,  0, 81],
       [62, 97, 45, 14, 52, 48, 99, 62, 80, 57],
       [11, 68, 84, 37,  2, 49, 67, 28,  3, 77],
       [ 1, 88, 39, 65, 37, 63, 34, 42, 88, 74]])

## 4.3 pandas数据结构之Series

In [12]:
data[1]

0    49
1    91
2    95
3    25
4    19
5    85
6     1
7    97
8    68
9    88
Name: 1, dtype: int32

In [13]:
type(data[1])

pandas.core.series.Series

In [14]:
type(data)

pandas.core.frame.DataFrame

In [15]:
data[1].shape

(10L,)

In [16]:
data[1].index

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [17]:
data[1].values

array([49, 91, 95, 25, 19, 85,  1, 97, 68, 88])

In [18]:
data[1].name

1

In [19]:
data[1][-2:]

8    68
9    88
Name: 1, dtype: int32

In [20]:
type(data[1][-2:])

pandas.core.series.Series

In [21]:
np.sign(data)

   0  1  2  3  4  5  6  7  8  9
0  1  1  1  1  1  1  1  1  1  1
1  1  1  1  1  1  1  1  1  1  1
2  1  1  1  1  1  1  1  1  1  1
3  1  1  1  1  1  1  1  1  1  1
4  1  1  1  1  1  1  1  0  1  1
5  1  1  1  1  1  1  1  1  1  1
6  1  1  1  1  1  1  1  1  0  1
7  1  1  1  1  1  1  1  1  1  1
8  1  1  1  1  1  1  1  1  1  1
9  1  1  1  1  1  1  1  1  1  1

In [22]:
data.columns[-1]

9

In [24]:
np.sign(data[9])

0    1
1    1
2    1
3    1
4    1
5    1
6    1
7    1
8    1
9    1
Name: 9, dtype: int32

## 4.4 利用pandas查询数据

In [25]:
data

    0   1   2   3   4   5   6   7   8   9
0  77  49  47  92  35   5  84  54  54  23
1  74  91  29  72  78  35  25  68  71  54
2  97  95  19  47  88  39  76  27  30  94
3  53  25   7  70  93  54  32  64  61  90
4   4  19  57  51  28  38   6   0  71  22
5  38  85  48  52  95  29  12   4  68   9
6   2   1  61  41  53  33  53  68   0  81
7  62  97  45  14  52  48  99  62  80  57
8  11  68  84  37   2  49  67  28   3  77
9   1  88  39  65  37  63  34  42  88  74

In [30]:
data.columns=['one','two','three','four','five','six','seven','eight','nine','ten']

In [37]:
data.index=[1,2,3,4,5,6,7,8,9,10]

In [38]:
data

    one  two  three  four  five  six  seven  eight  nine  ten
1    77   49     47    92    35    5     84     54    54   23
2    74   91     29    72    78   35     25     68    71   54
3    97   95     19    47    88   39     76     27    30   94
4    53   25      7    70    93   54     32     64    61   90
5     4   19     57    51    28   38      6      0    71   22
6    38   85     48    52    95   29     12      4    68    9
7     2    1     61    41    53   33     53     68     0   81
8    62   97     45    14    52   48     99     62    80   57
9    11   68     84    37     2   49     67     28     3   77
10    1   88     39    65    37   63     34     42    88   74

In [39]:
data.tail(2)

    one  two  three  four  five  six  seven  eight  nine  ten
9    11   68     84    37     2   49     67     28     3   77
10    1   88     39    65    37   63     34     42    88   74

In [40]:
data.head(2)

   one  two  three  four  five  six  seven  eight  nine  ten
1   77   49     47    92    35    5     84     54    54   23
2   74   91     29    72    78   35     25     68    71   54

In [41]:
data.index[-1]

10

In [46]:
data.loc[1]

one      77
two      49
three    47
four     92
five     35
six       5
seven    84
eight    54
nine     54
ten      23
Name: 1, dtype: int32

In [47]:
data.iloc[1]

one      74
two      91
three    29
four     72
five     78
six      35
seven    25
eight    68
nine     71
ten      54
Name: 2, dtype: int32

In [49]:
data[data.columns[-2:]]

    nine  ten
1     54   23
2     71   54
3     30   94
4     61   90
5     71   22
6     68    9
7      0   81
8     80   57
9      3   77
10    88   74

In [51]:
data.iat[1,0]

74

In [53]:
data.at[2,'one']

74

In [55]:
data[data>data.mean()]

    one  two  three  four  five  six  seven  eight  nine  ten
1    77  NaN     47    92   NaN  NaN     84     54    54  NaN
2    74   91    NaN    72    78  NaN    NaN     68    71  NaN
3    97   95    NaN   NaN    88  NaN     76    NaN   NaN   94
4    53  NaN    NaN    70    93   54    NaN     64    61   90
5   NaN  NaN     57   NaN   NaN  NaN    NaN    NaN    71  NaN
6   NaN   85     48   NaN    95  NaN    NaN    NaN    68  NaN
7   NaN  NaN     61   NaN   NaN  NaN     53     68   NaN   81
8    62   97     45   NaN   NaN   48     99     62    80  NaN
9   NaN   68     84   NaN   NaN   49     67    NaN   NaN   77
10  NaN   88    NaN    65   NaN   63    NaN     42    88   74

In [57]:
data.one

1     77
2     74
3     97
4     53
5      4
6     38
7      2
8     62
9     11
10     1
Name: one, dtype: int32

In [61]:
data[data.two>data.one.mean()]

    one  two  three  four  five  six  seven  eight  nine  ten
1    77   49     47    92    35    5     84     54    54   23
2    74   91     29    72    78   35     25     68    71   54
3    97   95     19    47    88   39     76     27    30   94
6    38   85     48    52    95   29     12      4    68    9
8    62   97     45    14    52   48     99     62    80   57
9    11   68     84    37     2   49     67     28     3   77
10    1   88     39    65    37   63     34     42    88   74

## 4.5 利用pandas的DataFrame进行统计运算

| 方法        | 说明   |
| --------   | :-----  |
| describe     | 返回描述性统计信息 |
| count        |   返回非NaN的数据项数量   |
| mad        |    计算绝对偏差，即类似于标准差的一个有力统计工具    |
| median        |    返回中位数    |
| min        |    返回最小值    |
| max        |    返回最大值    |
| mode        |    返回众数，出现次数最多的数    |
| std        |    返回离散度的标准差    |
| var        |    返回方差    |
| skew        |    返回偏态系数，表示的是数据分布的对称程度    |
| kurt        |    返回峰态系数，反映数据分布曲线顶端尖峭或者扁平程度    |

In [63]:
data.describe()

,one,two,three,four,five,six,seven,eight,nine,ten
count,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000
mean,41.900000,61.800000,43.600000,54.100000,56.100000,39.300000,48.800000,41.700000,52.600000,58.100000
std,35.741199,35.751612,21.925125,21.768734,31.490563,15.951663,31.800769,25.837312,31.141969,30.559414
min,1.000000,1.000000,7.000000,14.000000,2.000000,5.000000,6.000000,0.000000,0.000000,9.000000
25%,5.750000,31.000000,31.500000,42.500000,35.500000,33.500000,26.750000,27.250000,36.000000,30.750000
50%,45.500000,76.500000,46.000000,51.500000,52.500000,38.500000,43.500000,48.000000,64.500000,65.500000
75%,71.000000,90.250000,54.750000,68.750000,85.500000,48.750000,73.750000,63.500000,71.000000,80.000000
max,97.000000,97.000000,84.000000,92.000000,95.000000,63.000000,99.000000,68.000000,88.000000,94.000000

In [64]:
data.count()

one      10
two      10
three    10
four     10
five     10
six      10
seven    10
eight    10
nine     10
ten      10
dtype: int64

In [65]:
data.mad()

one      30.70
two      30.64
three    16.08
four     16.52
five     25.92
six      11.36
seven    27.00
eight    21.56
nine     24.96
ten      25.10
dtype: float64

In [66]:
data.median()

one      45.5
two      76.5
three    46.0
four     51.5
five     52.5
six      38.5
seven    43.5
eight    48.0
nine     64.5
ten      65.5
dtype: float64

In [67]:
data.min()

one       1
two       1
three     7
four     14
five      2
six       5
seven     6
eight     0
nine      0
ten       9
dtype: int32

In [68]:
data.max()

one      97
two      97
three    84
four     92
five     95
six      63
seven    99
eight    68
nine     88
ten      94
dtype: int32

In [69]:
data.mode()

   one  two  three  four  five  six  seven  eight  nine  ten
0  NaN  NaN    NaN   NaN   NaN  NaN    NaN     68    71  NaN

In [70]:
data.std()

one      35.741199
two      35.751612
three    21.925125
four     21.768734
five     31.490563
six      15.951663
seven    31.800769
eight    25.837312
nine     31.141969
ten      30.559414
dtype: float64

In [71]:
data.var()

one      1277.433333
two      1278.177778
three     480.711111
four      473.877778
five      991.655556
six       254.455556
seven    1011.288889
eight     667.566667
nine      969.822222
ten       933.877778
dtype: float64

In [72]:
data.skew()

one      0.113011
two     -0.666456
three    0.087188
four    -0.089352
five    -0.199771
six     -0.811585
seven    0.201438
eight   -0.597033
nine    -0.908044
ten     -0.521807
dtype: float64

In [74]:
data.kurt()

one     -1.626444
two     -1.250495
three    0.378298
four     0.469051
five    -1.025525
six      1.640843
seven   -1.312873
eight   -1.144854
nine    -0.535381
ten     -1.288289
dtype: float64

## 4.6 利用pandas的DataFrame实现数据聚合

In [75]:
import pandas as pd
from numpy.random import seed
from numpy.random import rand
from numpy.random import random_integers

In [83]:
df=pd.DataFrame({'Weather':['cold','hot','cold','hot','cold','hot','cold'],
                 'Food':['soup','soup','icecream','chocolate','icecream','icecream','soup'],
                 'Price':10*rand(7),
                 'Number':random_integers(1,9,size=(7,))})

In [84]:
df

        Food  Number     Price Weather
0       soup       4  2.418469    cold
1       soup       6  7.242578     hot
2   icecream       7  1.153277    cold
3  chocolate       1  2.781387     hot
4   icecream       5  3.525327    cold
5   icecream       1  4.860904     hot
6       soup       7  4.009786    cold

In [89]:
weather_group=df.groupby('Weather')

In [90]:
i=0
for name,group in weather_group:
    i=i+1
    print "group",i,name
    print group

group 1 cold
       Food  Number     Price Weather
0      soup       4  2.418469    cold
2  icecream       7  1.153277    cold
4  icecream       5  3.525327    cold
6      soup       7  4.009786    cold
group 2 hot
        Food  Number     Price Weather
1       soup       6  7.242578     hot
3  chocolate       1  2.781387     hot
5   icecream       1  4.860904     hot

In [91]:
weather_group.first()

         Food  Number     Price
Weather
cold     soup       4  2.418469
hot      soup       6  7.242578

In [92]:
weather_group.last()

             Food  Number     Price
Weather
cold         soup       7  4.009786
hot      icecream       1  4.860904

In [93]:
weather_group.mean()

           Number     Price
Weather
cold     5.750000  2.776715
hot      2.666667  4.961623

In [94]:
wf_group=df.groupby(['Weather','Food'])

In [95]:
wf_group.groups

{('cold', 'icecream'): [2L, 4L],
 ('cold', 'soup'): [0L, 6L],
 ('hot', 'chocolate'): [3L],
 ('hot', 'icecream'): [5L],
 ('hot', 'soup'): [1L]}

In [96]:
weather_group.groups

{'cold': [0L, 2L, 4L, 6L], 'hot': [1L, 3L, 5L]}

In [97]:
i=0
for name,group in wf_group:
    i=i+1
    print "group",i,name
    print group

group 1 ('cold', 'icecream')
       Food  Number     Price Weather
2  icecream       7  1.153277    cold
4  icecream       5  3.525327    cold
group 2 ('cold', 'soup')
   Food  Number     Price Weather
0  soup       4  2.418469    cold
6  soup       7  4.009786    cold
group 3 ('hot', 'chocolate')
        Food  Number     Price Weather
3  chocolate       1  2.781387     hot
group 4 ('hot', 'icecream')
       Food  Number     Price Weather
5  icecream       1  4.860904     hot
group 5 ('hot', 'soup')
   Food  Number     Price Weather
1  soup       6  7.242578     hot

In [101]:
weather_group.agg([np.mean,np.median])

           Number            Price
             mean median      mean    median
Weather
cold     5.750000      6  2.776715  2.971898
hot      2.666667      1  4.961623  4.860904

## 4.7 DataDrame的串联与附加操作

In [102]:
df[:3]

       Food  Number     Price Weather
0      soup       4  2.418469    cold
1      soup       6  7.242578     hot
2  icecream       7  1.153277    cold

In [103]:
df['Food']

0         soup
1         soup
2     icecream
3    chocolate
4     icecream
5     icecream
6         soup
Name: Food, dtype: object

In [105]:
df[1:3]

       Food  Number     Price Weather
1      soup       6  7.242578     hot
2  icecream       7  1.153277    cold

In [107]:
pd.concat([df[:3],df[5:]])

       Food  Number     Price Weather
0      soup       4  2.418469    cold
1      soup       6  7.242578     hot
2  icecream       7  1.153277    cold
5  icecream       1  4.860904     hot
6      soup       7  4.009786    cold

## 4.8 连接DataFrame

In [108]:
dest=pd.DataFrame({'EmpNr':[5,3,9],'Dest':['The Hague','Amsterdam','Rotterdam']})

In [109]:
tips=pd.DataFrame({'EmpNr':[5,9,7],'Amount':[10,5,2.5]})

In [110]:
pd.merge(dest,tips,on='EmpNr')

        Dest  EmpNr  Amount
0  The Hague      5      10
1  Rotterdam      9       5

In [111]:
dest.join(tips,lsuffix='Dest',rsuffix='tips')

        Dest  EmpNrDest  Amount  EmpNrtips
0  The Hague          5    10.0          5
1  Amsterdam          3     5.0          9
2  Rotterdam          9     2.5          7

In [112]:
pd.merge(dest,tips,how='inner')

        Dest  EmpNr  Amount
0  The Hague      5      10
1  Rotterdam      9       5

In [113]:
pd.merge(dest,tips,how='outer')

        Dest  EmpNr  Amount
0  The Hague      5    10.0
1  Amsterdam      3     NaN
2  Rotterdam      9     5.0
3        NaN      7     2.5

## 4.9 处理缺失数据

In [115]:
df=pd.merge(dest,tips,how='outer')

In [116]:
df

        Dest  EmpNr  Amount
0  The Hague      5    10.0
1  Amsterdam      3     NaN
2  Rotterdam      9     5.0
3        NaN      7     2.5

In [117]:
pd.isnull(df)

    Dest  EmpNr Amount
0  False  False  False
1  False  False   True
2  False  False  False
3   True  False  False

In [118]:
df.isnull()

    Dest  EmpNr Amount
0  False  False  False
1  False  False   True
2  False  False  False
3   True  False  False

In [119]:
pd.notnull(df)

    Dest EmpNr Amount
0   True  True   True
1   True  True  False
2   True  True   True
3  False  True   True

In [120]:
df.notnull()

    Dest EmpNr Amount
0   True  True   True
1   True  True  False
2   True  True   True
3  False  True   True

In [124]:
df[df.notnull()['Amount']]

        Dest  EmpNr  Amount
0  The Hague      5    10.0
2  Rotterdam      9     5.0
3        NaN      7     2.5

In [125]:
df.fillna(0)

        Dest  EmpNr  Amount
0  The Hague      5    10.0
1  Amsterdam      3     0.0
2  Rotterdam      9     5.0
3          0      7     2.5

## 4.10 处理日期数据

In [127]:
pd.date_range('1/1/1900',periods=42,freq='D')

DatetimeIndex(['1900-01-01', '1900-01-02', '1900-01-03', '1900-01-04',
               '1900-01-05', '1900-01-06', '1900-01-07', '1900-01-08',
               '1900-01-09', '1900-01-10', '1900-01-11', '1900-01-12',
               '1900-01-13', '1900-01-14', '1900-01-15', '1900-01-16',
               '1900-01-17', '1900-01-18', '1900-01-19', '1900-01-20',
               '1900-01-21', '1900-01-22', '1900-01-23', '1900-01-24',
               '1900-01-25', '1900-01-26', '1900-01-27', '1900-01-28',
               '1900-01-29', '1900-01-30', '1900-01-31', '1900-02-01',
               '1900-02-02', '1900-02-03', '1900-02-04', '1900-02-05',
               '1900-02-06', '1900-02-07', '1900-02-08', '1900-02-09',
               '1900-02-10', '1900-02-11'],
              dtype='datetime64[ns]', freq='D')

| 短码 | 说明 |
| :-------- | :-----:  |
| B| 营业日频率|
|C|自定义营业日频率|
|D|日历日频率|
|W|周频率|
|M|月末频率|
|BM|营业月末频率|
|MS|月初频率|
|BMS|营业月初频率|
|Q|季末频率|
|BQ|营业季末频率|
|QS|季初频率|
|BQS|印业季初频率|
|A|年终频率|
|BA|营业年终频率|
|AS|年初频率|
|BAS|营业年初频率|
|H|小时频率|
|T|分钟频率|
|S|秒频率|
|L|毫秒|
|U|微秒|

## 4.11 数据透视表

In [128]:
df=pd.DataFrame({'Weather':['cold','hot','cold','hot','cold','hot','cold'],
                 'Food':['soup','soup','icecream','chocolate','icecream','icecream','soup'],
                 'Price':10*rand(7),
                 'Number':random_integers(1,9,size=(7,))})

In [129]:
df

        Food  Number     Price Weather
0       soup       7  4.387123    cold
1       soup       3  9.941623     hot
2   icecream       6  7.205436    cold
3  chocolate       4  1.537441     hot
4   icecream       4  5.231881    cold
5   icecream       1  6.237714     hot
6       soup       1  7.780511    cold

In [131]:
pd.pivot_table(df,columns=['Food'],aggfunc=np.sum)

Food    chocolate   icecream       soup
Number   4.000000  11.000000  11.000000
Price    1.537441  18.675032  22.109257